app/controllers/what_to_discard_problems/comments_controller.rb

  def create
    comment = WhatToDiscardProblem.find(params[:what_to_discard_problem_id])
                                  .comments
                                  .new(**comment_params, user_id: current_user.id,)
---
SELECT `what_to_discard_problems`.* FROM `what_to_discard_problems` WHERE `what_to_discard_problems`.`user_id` = 53 AND `what_to_discard_problems`.`id` = 40 LIMIT 1