app/controllers/forum_threads_controller.rb

  def index
    @forum_threads = ForumThread.all
---
SELECT `forum_threads`.* FROM `forum_threads`

  def show
    @forum_thread = ForumThread.find(params[:id])
---
SELECT `forum_threads`.* FROM `forum_threads` WHERE `forum_threads`.`id` = 1 LIMIT 1