app/controllers/sessions_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'testuser1@test1.com' LIMIT 1
---
  def create
    user = User.find_by!(email: session_params[:email])