app/controllers/users_controller.rb

  def create
    auth_request = AuthRequest.find_by(id: session[:auth_request_id]&.to_i)

    # formDataで受け取るため、StrongParameter(JSON)を使えない
    create_params = { name: params[:name] }
    create_params[:profile_text] = params[:profile_text] if params[:profile_text].present?
    create_params[:avatar] = params[:avatar] if params[:avatar].present? && params[:avatar] != "undefined"

    user = User.new(
      email: auth_request&.email,
      **create_params,
    )

    if user.save
---
INSERT INTO `users` (`name`, `email`, `password_digest`, `created_at`, `updated_at`, `remember_digest`) VALUES ('test_user', 'test@test.com', '$2a$04$4sE1BU9a/cykRVuCJKxhY.UqRkIdIoJz.SM9FbTTQa0ze4ZDFPtXa', '2025-01-04 05:14:21.426823', '2025-01-04 05:14:21.426823', NULL)

  def show
    user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 266 LIMIT 1

  def update
    # formDataで受け取るため、StrongParameter(JSON)を使えない
    update_params = { name: params[:name] }
    update_params[:profile_text] = params[:profile_text] if params[:profile_text].present?
    update_params[:avatar] = params[:avatar] if params[:avatar].present? && params[:avatar] != "undefined"

    if current_user.update(update_params)
---
UPDATE `users` SET `users`.`name` = 'updated_name', `users`.`updated_at` = '2025-01-04 05:14:21.545962' WHERE `users`.`id` = 274

  def destroy
    User.destroy(current_user.id)
---
DELETE FROM `users` WHERE `users`.`id` = 276