app/controllers/what_to_discard_problems_controller.rb

  def create
    problem = current_user.created_what_to_discard_problems.new(problem_params)
---
INSERT INTO `what_to_discard_problems` (`round`, `turn`, `wind`, `dora`, `point_east`, `point_south`, `point_west`, `point_north`, `hand1`, `hand2`, `hand3`, `hand4`, `hand5`, `hand6`, `hand7`, `hand8`, `hand9`, `hand10`, `hand11`, `hand12`, `hand13`, `tsumo`, `created_at`, `updated_at`, `user_id`) VALUES ('東一', 1, '東', 1, 250, 250, 250, 250, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, '14', '2025-01-03 12:18:04.973596', '2025-01-03 12:18:04.973596', 19)